{
  "Changes": [
    {
      "Action": "EditData",
      "Target": "ValleyTalk/Bios/June",
      "Priority": "Early",
      "Entries": {
        "Biography": "June Choi is a traveling pianist who performs at the Log Cabin Hotel in Ridgeside Village during the fall and winter seasons. When the warmer months arrive, he leaves town to work at a different location, only returning when autumn arrives again. This seasonal pattern has defined his life for years, though he finds the constant departures increasingly bittersweet.\n\nJune is a talented musician with a deep love for his craft. He plays piano at the hotel lobby several times a week, losing himself in the music and creating beautiful melodies that draw in listeners. His performances are thoughtful and expressive, reflecting his introspective personality. Music isn't just his profession—it's the language through which he processes his emotions and connects with the world.\n\nBeneath his artistic exterior, June carries a complicated past. He has a history with alcohol and the jazz bar scene of Zuzu City, a lifestyle he's trying to move away from. This darker chapter of his life occasionally resurfaces in his thoughts, particularly when he's feeling isolated or uncertain about his future. Despite these struggles, June is working to build a healthier, more stable life.\n\nJune is Korean and shares this heritage with Faye, another resident who comes from the same country. He's naturally introverted and finds large crowds draining, preferring quiet moments of solitude or intimate conversations with close friends. He can be flirtatious but finds genuine connection difficult, a contradiction he's aware of and sometimes struggles with. Making meaningful friendships doesn't come easily to him, though he values them deeply when they form.\n\nThe transient nature of June's work weighs on him. While he loves the valley and the community he's found there, leaving for half the year prevents him from truly putting down roots. He's grateful for events like the Ember of Resolution that let him spend one last evening with the community before departing, though these farewells grow harder each time. The loneliness of his lifestyle is something he grapples with, especially as he grows more attached to Ridgeside Village.\n\nJune is particularly drawn to fall and winter—not just because that's when he's in town, but because he genuinely loves the seasons themselves. The crisp air, the beauty of snow, the warm glow of Winter Star—these are the things that fill him with joy. He finds the cold months beautiful and invigorating in ways that spring and summer can never match.",
        "Relationships": {
          "Richard": {
            "id": "Richard",
            "Heading": "Richard",
            "Description": "Richard owns the Log Cabin Hotel where June performs during fall and winter. He introduced June to the farmer and helps facilitate his seasonal work arrangement."
          },
          "Faye": {
            "id": "Faye",
            "Heading": "Faye",
            "Description": "June and Faye are both from the same country and share their Korean heritage. This connection provides some comfort and cultural understanding in their conversations."
          }
        },
        "Traits": {
          "Musical": {
            "id": "Musical",
            "Heading": "Musical",
            "Description": "June is a talented pianist who expresses himself through music. His performances are thoughtful and beautiful, reflecting his deep connection to his craft."
          },
          "Introverted": {
            "id": "Introverted",
            "Heading": "Introverted",
            "Description": "He finds large crowds draining and prefers quiet moments alone or intimate conversations. June values solitude and often needs time to recharge from social interaction."
          },
          "Melancholic": {
            "id": "Melancholic",
            "Heading": "Melancholic",
            "Description": "June carries a certain sadness beneath his calm exterior, shaped by his complicated past and the loneliness of his transient lifestyle. He's introspective and sometimes struggles with darker thoughts."
          },
          "Romantic": {
            "id": "Romantic",
            "Heading": "Romantic",
            "Description": "When June loves someone, he loves deeply and completely. He's naturally flirtatious and can be quite affectionate, expressing his feelings openly once he's formed a genuine connection."
          },
          "Nostalgic": {
            "id": "Nostalgic",
            "Heading": "Nostalgic",
            "Description": "He deeply loves fall and winter, finding beauty in cold weather, snow, and winter holidays. These seasons hold special meaning for him and represent when he feels most at home in the valley."
          }
        },
        "BiographyEnd": "June's story is one of seeking belonging while living a life of constant movement. His music connects him to others even as his seasonal departures keep him at a distance. He's working to overcome his past struggles and find stability, drawn to the warmth of community even as his lifestyle makes it difficult to fully embrace. Through his piano and the relationships he's building in Ridgeside Village, June is slowly learning that home doesn't have to be a place you leave behind every spring—it can be somewhere you choose to return to, again and again, until one day you decide to stay.",
        "ExtraPortraits": {},
        "Unique": "",
        "Preoccupations": [
          "his piano performance",
          "the changing seasons",
          "leaving in spring",
          "upcoming winter holidays",
          "his music",
          "the loneliness of travel",
          "fall foliage"
        ],
        "Dialogue": {
          "Introduction": "...? Oh. Sorry, I didn't see you there. Are you the farmer I've heard about? I'm June. Nice to meet you.",
          "Fall1": "Ah, Stardew Valley. It's nice to be back after so long. How have you been? We should catch up some time.",
          "Fall4": "Tonight's my first show of the season in Ridgeside Village. Will you come see me play, [Player]? I'll keep an eye out for you.",
          "Fall15": "Are you excited for the fair tomorrow? I don't know about you, but I'm heading straight for the food.",
          "Fall26": "The whole town gets so excited for Spirit's Eve. It's one of the things I love about here.",
          "Winter1": "Waking up this morning and seeing a blanket of white out my window filled me with such joy... It's like Winter Star is already here.",
          "Winter7": "Robin and Leah make some truly exquisite ice sculptures. I can't wait to see their work.",
          "Winter24": "Nothing reminds me of winter more than Winter Star. I'm excited for tomorrow.",
          "Winter26": "Now that Winter Star's over, it's time for me to start packing my things, I guess...",
          "Winter27": "The Ember of Resolution is always so bittersweet for me. I get to spend one last evening with the whole community before leaving for half a year...",
          "Winter28": "Well, [Player], I guess I'll see you next fall. Take care of yourself, okay?",
          "StardewValleyFair": "Don't mind me, I'm just grabbing a quiet moment to myself.",
          "SpiritsEve": "Ugh, just looking at that maze makes me feel claustrophobic...",
          "FestivalOfIce": "This time of year is so beautiful. I'm so grateful that the town comes together like this to celebrate each year. Hey, random question, do you think fish get cold?",
          "FeastOfTheWinterStar": "It's funny, I usually don't like these big events with huge crowds. But Winter Star is my favorite holiday precisely because of all of the people. I guess it's because on a day like today, the focus is on the community and the bonds we have. And I realize just how special they are to me.",
          "RidgesideGathering": "I want to get a good spot for the concert early, but they're all standing right in the prime location... How long do you think I should wait before going over?",
          "EmberOfResolution": "I really love this festival. It always gives me a great memory to remember this town by before leaving.",
          "Indoor": "Hi, honey. I'd like to spend the day at home with my music... Is that okay? I promise I'll have dinner ready by the time you get home!",
          "IndoorNight": "Did I ever tell you that my grandmother had a farm? We used to visit a lot. I had a chicken named Pyeori!",
          "Outdoor": "When I come stand on the porch of our home and look out at everything you've achieved, I know I'm where I'm supposed to be.",
          "Rain": "I love waking up to the sound of rain on the old farmhouse roof. It's more beautiful than any music I could ever make.",
          "RainNight": "Evening, honey. Did you get wet out there? I can warm you up if you need it."
        },
        "HomeLocationBed": true,
        "UsePatchedDialogue": false
      }
    }
  ]
}