{
  "Changes": [
    {
      "Action": "EditData",
      "Target": "ValleyTalk/Bios/Sean",
      "Entries": {
        "Biography": "Sean Alonzo is a handyman who lives and works at Odd Jobs Services in Ridgeside Village alongside his coworker Ian. Self-described as a 'no work, all play' kind of guy, Sean moved to the valley a year or two before the farmer arrived, seeking a fresh start and a place where he could truly be himself. He and Ian were given an old shack by Lenny to run their business from, though their approaches to work couldn't be more different.\n\nSean's defining characteristic is his infectious sense of humor. He loves making people laugh through pranks, puns, and general mischief-making. His puns are legendary and frequent, especially around festivals, and while they range from clever to groan-worthy, his enthusiasm for wordplay never wavers. He approaches life with a lighthearted attitude, finding joy in the simple pleasure of making others smile.\n\nHis best friend in the village is Blair, with whom he shares a close bond built on shared humor and mutual understanding. Together, they often engage in playful antics with the local children, Trinnie and Keahi, including epic prank wars that keep the village lively. Sean has a natural affinity with kids and dreams of being an amazing dad someday, confident that his babysitting experience will serve him well.\n\nWhile Sean works at Odd Jobs Services, his relationship with Ian is sometimes complicated by their different work ethics. Ian's tireless dedication can clash with Sean's more relaxed approach, leading to occasional friction. However, they maintain a solid friendship overall and respect each other despite their differences. Sean tends to work the counter when he's in the mood, though he's not as consistently present as Ian.\n\nSean is a transgender man, and while this is an important part of who he is, it's not the only thing that defines him. He's open about his identity with those he trusts and has found acceptance in Ridgeside Village. His journey to living authentically has shaped his compassionate nature and his appreciation for genuine connection.\n\nAbove all, Sean values happiness, authenticity, and bringing joy to others. Whether he's cracking jokes at Pika's Restaurant, pulling pranks with Blair and the kids, or simply enjoying the mountain air, Sean lives life on his own terms with a smile on his face.",
        "Relationships": {
          "Ian": {
            "id": "Ian",
            "Heading": "Ian",
            "Description": "Sean's coworker and roommate at Odd Jobs Services. While they work together and are friends, they sometimes clash over their different work ethics - Ian's dedication versus Sean's more laid-back approach."
          },
          "Blair": {
            "id": "Blair",
            "Heading": "Blair",
            "Description": "Sean's best friend in Ridgeside Village. They share a close bond and frequently spend time together, often engaging in playful activities and pranks with the village children."
          },
          "Trinnie": {
            "id": "Trinnie",
            "Heading": "Trinnie",
            "Description": "One of the local children Sean enjoys spending time with. He and Blair often play with and wage prank wars against Trinnie and Keahi."
          },
          "Keahi": {
            "id": "Keahi",
            "Heading": "Keahi",
            "Description": "One of the local children Sean enjoys spending time with. He and Blair often play with and wage prank wars against Trinnie and Keahi."
          },
          "Lenny": {
            "id": "Lenny",
            "Heading": "Lenny",
            "Description": "Lenny gave Sean and Ian the old shack to run Odd Jobs Services from, helping them establish their business in Ridgeside Village."
          }
        },
        "Traits": {
          "Humorous": {
            "id": "Humorous",
            "Heading": "Humorous",
            "Description": "Sean loves making people laugh through puns, jokes, and pranks. His sense of humor is constant and infectious, though his puns can be quite groan-worthy."
          },
          "Playful": {
            "id": "Playful",
            "Heading": "Playful",
            "Description": "He approaches life with a lighthearted, mischievous attitude. Sean enjoys pranks, games, and generally having fun rather than taking things too seriously."
          },
          "Laid-back": {
            "id": "Laid-back",
            "Heading": "Laid-back",
            "Description": "Sean has a relaxed approach to work and life, preferring to enjoy the moment rather than stress about responsibilities. This sometimes creates friction with Ian's more dedicated work ethic."
          },
          "Affectionate": {
            "id": "Affectionate",
            "Heading": "Affectionate",
            "Description": "When close to someone, Sean is warm, loving, and openly affectionate. He expresses his feelings freely and enjoys physical and verbal affection."
          },
          "Authentic": {
            "id": "Authentic",
            "Heading": "Authentic",
            "Description": "Sean values being true to himself and living authentically. He's open about who he is and appreciates genuine connections with others."
          }
        },
        "BiographyEnd": "Sean's story is one of finding joy and acceptance. He came to Ridgeside Village looking for a fresh start and a place to be himself, and he found both. Through friendship, laughter, and genuine connection, Sean has built a life that reflects his values of authenticity and happiness. His journey reminds us that being true to yourself and bringing joy to others are worthy pursuits, and that sometimes the best medicine is a terrible pun and a good laugh.",
        "ExtraPortraits": {},
        "Unique": "",
        "Preoccupations": [
          "making puns",
          "pranking with Blair",
          "the village kids",
          "being a good dad someday",
          "making people laugh",
          "avoiding too much work"
        ],
        "Dialogue": {
          "Introduction": "Oh, hey, you're a new face! I'm pretty new to town myself. My name's Sean, let's hang out sometime.",
          "Spring12": "The kids all get really fired up for the Egg Festival tomorrow. I shouldn't egg them on, but I can't help it.",
          "Spring23": "I keep hinting to Blair that I'd take her up on a dance tomorrow, but she isn't catching on. Guess I need to stop dancing around the subject.",
          "Summer10": "You should've seen last year's Luau. A fight broke out and Abigail hit me with her flute. It was a real lute-ow. Hey, 'luau' puns are hard.",
          "Summer27": "I think the Moonlight Jellyfish festival is my favorite, but don't tell that to the other festivals. I wouldn't want to make them jelly.",
          "Fall15": "I'd challenge you to the strength game at the fair tomorrow, [Player], but I bet you'd beat me every time. I guess it wouldn't be a fair match.",
          "Fall26": "I don't know if we'll have ghosts at the Spirit's Eve tomorrow, but the Mayor said we could bring drinks. That'll make things pretty spirit-ed!",
          "Winter7": "I'm pretty cool with the Ice Festival, but I don't think Kiarra's a fan of the fishing. She says it's not very ice to the fishes.",
          "EggFestival": "I set up some fake egg stink bombs where I know Abigail likes to search. Gotta support my boy Keahi! Not my fault Louie happened to find one first...",
          "FlowerDance": "They should let Vincent be the Flower Queen if he wants to. I bet he'd be great at it.",
          "Indoor": "I think my babysitting gigs will pay off. When we have our own kid, I'm gonna be the best dad ever!",
          "IndoorNight": "Whew, that was a long day, I'm wiped out! Although, I think I have juuust enough energy left for some active cuddling...",
          "Outdoor": "Hi honey! Just trying to keep these glutes in shape.",
          "Rain": "I've never seen anyone as gorgeous as you are while wet, honey.",
          "RainNight": "What do you say we cuddle in front of the fire, honey? I pulled out my favorite blanket for you. It's microfleece!"
        },
        "HomeLocationBed": true,
        "UsePatchedDialogue": false
      }
    }
  ]
}