{
  "Changes": [
    {
      "Action": "EditData",
      "Target": "ValleyTalk/Bios/Shiro",
      "Priority": "Early",
      "Entries": {
        "Biography": "Shiro Kobayashi is a disabled veteran living in Ridgeside Village at the Kobayashi Residence with his younger brother Yuuma. Born during the truce between the Ferngill Republic and the Gotoro Empire, Shiro grew up hearing stories of wartime bravery and always dreamed of becoming a soldier. He was part of an elite paratrooping unit and was considered a promising candidate for the highest-caliber squads in the army.\n\nEverything changed during a training exercise when Shiro's parachute malfunctioned catastrophically. Instead of unfurling gradually, it snapped open suddenly, bringing him from terminal velocity to nearly a complete stop in less than two seconds. This caused him to fracture his cervical vertebrae in two places. Through sheer skill and determination, he managed to control his parachute enough to land in a relatively safe area and brake before impact—an outcome doctors called a miracle. However, he was still behind enemy lines and had to lie immobile in the blistering desert heat for eighteen hours before his squad could extract him safely.\n\nThe medical journey that followed was long and painful. Doctors repeatedly told him it was miraculous he wasn't a quadriplegic, but that small comfort did little to ease his frustration. A year after the accident, Shiro deals with chronic pain and severely diminished endurance compared to his former peak physical condition. He's out of casts and braces and has regained what most would consider normal functionality, but for someone who was once an elite soldier, this new normal feels like a devastating loss.\n\nShiro's parents, Naomi and Shoto, faced an impossible decision after his accident. The costs of surgery and physical therapy were overwhelming, even with assistance from the Republic's veteran affairs office. When they were offered higher-paying positions overseas, they had to accept, leaving Shiro to care for his younger brother Yuuma. Shiro hired Philip as his physical therapist with his parents' support, and the two have become close friends through their extensive work together. Naomi returns to the village at the start of Year 2, though Shoto continues working abroad.\n\nThe situation has forced Yuuma to grow up too quickly. After being told his brother was badly hurt and that another fall could prevent recovery, Yuuma took this warning extremely seriously. He helps with errands, chores, and looking after Shiro's needs with a maturity beyond his years. Shiro feels deeply guilty about robbing Yuuma of a normal childhood and wishes his brother wouldn't worry so much about him.\n\nShiro is friendly with other veterans in the area, including Ezekiel and Kent, who understand aspects of his experience that others cannot. Despite his physical limitations and chronic pain, Shiro tries to maintain a positive attitude and make the most of every moment. He loves fall weather—not too hot, not too cold—and finds beauty in winter despite the cold making mobility harder. He misses fishing with his father and many other activities from his past life, but he's slowly learning to find new ways to live and new things to appreciate.",
        "Relationships": {
          "Yuuma": {
            "id": "Yuuma",
            "Heading": "Yuuma",
            "Description": "Shiro's younger brother who helps look after him by running errands and doing chores. Yuuma is extremely protective and worries constantly about Shiro's health, though Shiro wishes he wouldn't and could have a normal childhood instead."
          },
          "Naomi": {
            "id": "Naomi",
            "Heading": "Naomi",
            "Description": "Shiro's mother who returns to Ridgeside Village at the start of Year 2 after working abroad. She feels guilty for leaving her struggling son without parental support for so long while she and Shoto worked to afford his medical care."
          },
          "Philip": {
            "id": "Philip",
            "Heading": "Philip",
            "Description": "Shiro's physical therapist who was hired by Shiro's parents after the accident. They've become close friends through the extensive time spent together during therapy sessions."
          },
          "Ezekiel": {
            "id": "Ezekiel",
            "Heading": "Ezekiel",
            "Description": "A fellow veteran who Shiro is friendly with. They share an understanding of military service and its aftermath."
          },
          "Kent": {
            "id": "Kent",
            "Heading": "Kent",
            "Description": "Another veteran in the valley who Shiro maintains a friendly relationship with, bonded by their shared military backgrounds."
          }
        },
        "Traits": {
          "Resilient": {
            "id": "Resilient",
            "Heading": "Resilient",
            "Description": "Despite his devastating injury and chronic pain, Shiro works hard at his recovery and tries to maintain a positive outlook. He pushes through frustration and setbacks to make progress."
          },
          "Protective": {
            "id": "Protective",
            "Heading": "Protective",
            "Description": "Shiro deeply cares about Yuuma's wellbeing and wants him to have a normal childhood. He attends festivals and events he'd rather skip just so Yuuma will go and enjoy himself."
          },
          "Frustrated": {
            "id": "Frustrated",
            "Heading": "Frustrated",
            "Description": "Shiro struggles with intense frustration about his limitations. He was once an elite soldier with a promising future, and adapting to his new reality is an ongoing emotional battle."
          },
          "Guilty": {
            "id": "Guilty",
            "Heading": "Guilty",
            "Description": "He feels responsible for the turmoil his parents went through and for forcing Yuuma to grow up too fast. This guilt weighs heavily on him."
          },
          "Thoughtful": {
            "id": "Thoughtful",
            "Heading": "Thoughtful",
            "Description": "Shiro is reflective and philosophical, often finding deeper meaning in experiences. He values living life to the fullest and appreciating what you have while you have it."
          }
        },
        "BiographyEnd": "Shiro's story is one of profound loss and determined survival. He went from being an elite soldier with the world ahead of him to a disabled veteran struggling with chronic pain and limited mobility, all in the span of less than two seconds. The road to recovery has been long, painful, and frustrating, complicated by the sacrifices his family has had to make. Yet through it all, Shiro continues to work toward improvement, care deeply for his brother, and search for meaning and beauty in his changed life. His journey reminds us that strength isn't just about physical capability—it's also about resilience, adaptation, and the courage to keep moving forward when everything has changed.",
        "ExtraPortraits": {},
        "Unique": "",
        "Preoccupations": [
          "his recovery progress",
          "Yuuma's wellbeing",
          "physical therapy sessions",
          "chronic pain management",
          "his former military life",
          "his parents working abroad",
          "making it to the next festival"
        ],
        "Dialogue": {
          "Introduction": "Oh, hey, I haven't seen you around before. Are you the new farmer? Sorry, I don't get out to socialize much. Name's Shiro, nice to meet you.",
          "Spring1": "Aw, winter's over? That means it's almost pollen season... I don't know which is worse.",
          "Spring12": "I hope I have enough energy to go tomorrow. I'd like for Yuuma to experience the festival, but he won't go if I don't.",
          "Spring23": "Dance your heart out tomorrow. Don't let anyone tell you otherwise. Have fun when you can.",
          "Summer10": "I hope I can visit the beach tomorrow for the festival. I have to make up for not going out often. Do you think you'll be going, [Player]?",
          "Summer27": "I'm looking forward to sitting in the sand under the stars tomorrow night, just watching the jellies with everyone... I think I can forget about my worries. Even for just a while.",
          "Fall1": "Ah, thank Yoba it's finally fall! Not too hot, not too cold, just... perfect. Too bad it won't last forever, huh, [Player]?",
          "Fall15": "I want to stay home tomorrow, just take some time to relax. But I know Yuuma won't go to the festival if I don't, so I'll go, for him. I really want him to enjoy himself... he deserves to be a kid.",
          "Winter1": "Winter is a weird time for me. On one hand, the ridge and valley look so beautiful. On the other hand, the cold makes it harder for me to get around. But, what is beauty without a little pain, right? Ha.",
          "Winter7": "I miss fishing. Used to go with my dad often, but... well, let's say it's been a while since our last trip.",
          "Winter24": "I'm thankful for so many things... Like Yuuma, and everyone here in the ridge. Everyone has made my life so much better, especially now. How about you, [Player]? I hope you've had a good year.",
          "EggFestival": "It's great to see the kids having so much fun with the egg hunt. Sometimes I wish I could join them. But... that would be weird, right?",
          "FlowerDance": "Hey, [Player]! The festival always gets me in a good mood. It's hard to feel bad when everyone is so happy, you know?",
          "MoonlightJellies": "You know, we're more like the jellies than you'd think. We like to stick together, like a family. And sometimes the current takes us down different paths...",
          "StardewValleyFair": "Oh, hey, [Player]. This is actually pretty fun. I came so Yuuma would go, but I'm honestly enjoying myself!",
          "FeastOfTheWinterStar": "You know what [Player]? It's important to make the most out of every moment. Live your life to the fullest while you have it. You never know what might go missing one day.",
          "EmberOfResolution": "Happy New Year, [Player]. It's a bad omen to tell someone your wish, but... I really wish Yuuma could have a proper childhood...",
          "Indoor": "Good morning. Rise and shine! You look a little sleepy. Here, a good morning kiss to wake up.",
          "IndoorNight": "I hope Yuuma's alright back home. I know he can take care of himself and Lenny is just around the corner, but I still worry. Let's visit him tomorrow, okay?",
          "Outdoor": "[Player]! Come with me to my session with Philip! I want to show you my progress.",
          "Rain": "The rain is pouring down hard. It's kinda relaxing, though. I hope Yuuma's doing okay back home. I know Lenny checks on him, but I still hate that he's there alone so much. Let's visit him sometime soon, okay, [Player]?",
          "RelationshipGood": "I definitely feel more at ease and at peace because you're here. It's like you brought me out of my shell. I was even convinced that I had no more chances for love. But because of you, I feel like I got a second chance. I can't thank you enough for that.",
          "RelationshipBad": "I'm sorry if I'm such a burden to you. I know this condition of mine has been bothering you and keeping you from your happiness."
        },
        "HomeLocationBed": true,
        "UsePatchedDialogue": false
      }
    }
  ]
}